# =========================================================
# 필요한 모듈은 이곳에 importing 합니다.
import re
# 필요한 모듈은 이곳에 importing 합니다.
# =========================================================


# =========================================================
# 이곳에 함수를 작성합니다.
def example():
    return "함수를 작성하는 부분입니다."
# 이곳에 함수를 작성합니다.
# =========================================================


# =========================================================
# 따로 설정할 필요 없습니다.

def main():
    print("함수 사전 목록을 불러옵니다.")


if __name__ == "__main__":
    main()
    func_list = []

    for i in dir():
        if re.search('[__]+', i) or i == "i" or i == "re" or i == "main":
            pass
        else:
            func_list.append(i)

    for num, func in enumerate(func_list, start=1):
        print("{0}: {1}".format(num, func))

# 따로 설정할 필요 없습니다.
# =========================================================
